# EndZOffsetValue Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..EndZOffsetValue Property
ParameterTypeId Class See Also
---
"End z Offset Value"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId EndZOffsetValue { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property EndZOffsetValue As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ EndZOffsetValue {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace